# Exploración del dataset
    Aquí se analizará el dataset para posteriormente aplicar transfromaciones de ser necesario

In [24]:
import pandas as pd
import numpy as np
import logging
from config import API_BASE_URL, API_TOKEN, EMAIL
from ingest import fetch_data, parse_data

PARAMS = {
    "email": EMAIL,
    "key": API_TOKEN,
    "type": "ecommerce",
    "rows": 1000,
    "format": "json"
}

CATEGORIES = 'categories'
BRANDS = 'brands'
SUPPLIERS = 'suppliers'
WAREHOUSES = 'warehouses'
PRODUCTS = 'products'
INVENTORY = 'inventory'
CUSTOMERS = 'customers'
PROMOTIONS = 'promotions'
ORDERS = 'orders'
ORDER_ITEMS = 'order_items'
REVIEWS = 'reviews'

logging.basicConfig(
        level=logging.INFO,
        format='%(asctime)s - %(levelname)s - %(message)s'
)
logger = logging.getLogger(__name__)

try:
    resp = fetch_data(API_BASE_URL, PARAMS, logger)
    tables = parse_data(resp)

    print(tables.keys())
except Exception as e:
    logger.error(f"An error occurred: {e}")

2026-01-10 21:01:27,843 - INFO - Fetching 1000 rows of ecommerce data...

dict_keys(['categories', 'brands', 'suppliers', 'warehouses', 'products', 'inventory', 'customers', 'promotions', 'orders', 'order_items', 'reviews'])

In [25]:
tables[CATEGORIES].info()
tables[CATEGORIES].head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   category_id         10 non-null     int64
 1   category_name       10 non-null     object
 2   description         10 non-null     object
 3   parent_category_id  2 non-null      float64
 4   is_active           10 non-null     bool
 5   display_order       10 non-null     int64
dtypes: bool(1), float64(1), int64(2), object(2)
memory usage: 542.0+ bytes

,category_id,category_name,description,parent_category_id,is_active,display_order
0,1,Electrónica,Productos de electrónica,NaN,True,1
1,2,Ropa,Productos de ropa,NaN,True,2
2,3,Hogar,Productos de hogar,2.0,True,3
3,4,Deportes,Productos de deportes,NaN,True,4
4,5,Libros,Productos de libros,NaN,False,5

In [26]:
tables[BRANDS].info()
tables[BRANDS].head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   brand_id           15 non-null     int64
 1   brand_name         15 non-null     object
 2   country_of_origin  15 non-null     object
 3   founded_year       15 non-null     int64
 4   website            15 non-null     object
 5   is_premium         15 non-null     bool
dtypes: bool(1), int64(2), object(3)
memory usage: 747.0+ bytes

,brand_id,brand_name,country_of_origin,founded_year,website,is_premium
0,1,TechPro,Argentina,1973,https://www.techpro.com,False
1,2,StyleMax,China,1963,https://www.stylemax.com,False
2,3,HomeLife,Alemania,1962,https://www.homelife.com,False
3,4,SportElite,Brasil,2013,https://www.sportelite.com,False
4,5,BookWorld,China,1972,https://www.bookworld.com,False

In [27]:
tables[SUPPLIERS].info()
tables[SUPPLIERS].head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   supplier_id    8 non-null      int64
 1   supplier_name  8 non-null      object
 2   contact_name   8 non-null      object
 3   email          8 non-null      object
 4   phone          8 non-null      object
 5   address        8 non-null      object
 6   rating         8 non-null      float64
 7   is_active      8 non-null      bool
dtypes: bool(1), float64(1), int64(1), object(5)
memory usage: 588.0+ bytes

,supplier_id,supplier_name,contact_name,email,phone,address,rating,is_active
0,1,Distribuidora Norte,Ana Martínez,contact@distribuidoranorte.com,+1 995-156-4311,711 La Plata,3.3,True
1,2,Importadora Sur,Juan Pérez,contact@importadorasur.com,+1 941-207-7675,9438 Mendoza,3.4,True
2,3,Mayorista Central,Juan Pérez,contact@mayoristacentral.com,+1 710-251-2959,7543 Rosario,3.7,True
3,4,Logística Express,Juan Pérez,contact@logísticaexpress.com,+1 858-454-6063,5157 Córdoba,4.5,True
4,5,Proveedores Unidos,Ana Martínez,contact@proveedoresunidos.com,+1 870-139-4744,6048 Salta,3.8,True

In [28]:
tables[WAREHOUSES].info()
tables[WAREHOUSES].head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   warehouse_id       5 non-null      int64
 1   warehouse_name     5 non-null      object
 2   location           5 non-null      object
 3   capacity_units     5 non-null      int64
 4   current_occupancy  5 non-null      int64
 5   manager_name       5 non-null      object
dtypes: int64(3), object(3)
memory usage: 372.0+ bytes

,warehouse_id,warehouse_name,location,capacity_units,current_occupancy,manager_name
0,1,Depósito 1,Buenos Aires,25890,57,Sofía Ramírez
1,2,Depósito 2,Córdoba,24593,61,Laura Torres
2,3,Depósito 3,Rosario,56907,53,Laura Torres
3,4,Depósito 4,Mendoza,56607,62,Diego Fernández
4,5,Depósito 5,La Plata,32305,41,Laura Torres

In [29]:
tables[PRODUCTS].info()
tables[PRODUCTS].head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    100 non-null    int64
 1   sku           100 non-null    object
 2   product_name  100 non-null    object
 3   description   100 non-null    object
 4   category_id   100 non-null    int64
 5   brand_id      100 non-null    int64
 6   supplier_id   100 non-null    int64
 7   price         100 non-null    float64
 8   cost          100 non-null    float64
 9   weight_kg     100 non-null    float64
 10  is_active     100 non-null    bool
 11  created_at    100 non-null    object
 12  updated_at    100 non-null    object
dtypes: bool(1), float64(3), int64(4), object(5)
memory usage: 9.6+ KB

,product_id,sku,product_name,description,category_id,brand_id,supplier_id,price,cost,weight_kg,is_active,created_at,updated_at
0,1,SKU-000001,Elite Artículo 1,Descripción detallada del producto 1,4,3,6,469.49,225.36,10.5,True,2023-03-01,2025-05-16
1,2,SKU-000002,Super Kit 2,Descripción detallada del producto 2,4,3,3,70.69,40.29,23.6,True,2022-10-27,2025-12-02
2,3,SKU-000003,Elite Producto 3,Descripción detallada del producto 3,10,12,8,33.40,19.37,46.3,True,2022-05-06,2024-12-06
3,4,SKU-000004,Smart Dispositivo 4,Descripción detallada del producto 4,2,3,6,330.31,132.12,10.5,True,2023-02-18,2025-06-17
4,5,SKU-000005,Básico Kit 5,Descripción detallada del producto 5,5,3,8,365.16,215.44,39.2,True,2022-06-08,2025-03-14

In [30]:
tables[INVENTORY].info()
tables[INVENTORY].head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 184 entries, 0 to 183
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   inventory_id       184 non-null    int64
 1   product_id         184 non-null    int64
 2   warehouse_id       184 non-null    int64
 3   quantity           184 non-null    int64
 4   min_stock_level    184 non-null    int64
 5   max_stock_level    184 non-null    int64
 6   last_restock_date  184 non-null    object
dtypes: int64(6), object(1)
memory usage: 10.2+ KB

,inventory_id,product_id,warehouse_id,quantity,min_stock_level,max_stock_level,last_restock_date
0,1,1,1,42,35,295,2025-02-14
1,2,1,1,117,11,482,2026-01-07
2,3,1,3,65,36,608,2024-01-26
3,4,2,4,287,12,588,2024-01-18
4,5,3,4,85,25,540,2025-08-23

In [31]:
tables[CUSTOMERS].info()
tables[CUSTOMERS].head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 334 entries, 0 to 333
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        334 non-null    int64
 1   first_name         334 non-null    object
 2   last_name          334 non-null    object
 3   email              334 non-null    object
 4   phone              334 non-null    object
 5   birth_date         334 non-null    object
 6   city               334 non-null    object
 7   country            334 non-null    object
 8   postal_code        334 non-null    int64
 9   segment            334 non-null    object
 10  registration_date  334 non-null    object
 11  last_login         334 non-null    object
 12  is_verified        334 non-null    bool
 13  accepts_marketing  334 non-null    int64
dtypes: bool(1), int64(3), object(10)
memory usage: 34.4+ KB

,customer_id,first_name,last_name,email,phone,birth_date,city,country,postal_code,segment,registration_date,last_login,is_verified,accepts_marketing
0,1,Martín,Martínez,martín.martínez1@email.com,+1 539-440-7730,1967-07-30,Mendoza,Argentina,99215,Gold,2023-09-22,2025-11-29,False,0
1,2,Lucas,Torres,lucas.torres2@email.com,+1 432-300-1214,1963-10-17,Tucumán,Chile,33138,Silver,2020-06-11,2023-01-28,True,1
2,3,Juan,Ramírez,juan.ramírez3@email.com,+1 992-450-9425,1974-05-12,Córdoba,México,19806,Gold,2023-08-27,2026-01-07,True,0
3,4,Camila,González,camila.gonzález4@email.com,+1 374-302-2814,2002-12-22,Tucumán,Colombia,22846,Gold,2021-12-31,2023-02-24,True,0
4,5,Mateo,García,mateo.garcía5@email.com,+1 278-856-9116,1965-07-15,Córdoba,Argentina,78911,Gold,2023-03-08,2023-10-16,True,1

In [32]:
tables[PROMOTIONS].info()
tables[PROMOTIONS].head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   promotion_id      10 non-null     int64
 1   promotion_code    10 non-null     object
 2   promotion_name    10 non-null     object
 3   promotion_type    10 non-null     object
 4   discount_value    10 non-null     int64
 5   min_order_amount  10 non-null     int64
 6   max_uses          10 non-null     int64
 7   current_uses      10 non-null     int64
 8   start_date        10 non-null     object
 9   end_date          10 non-null     object
 10  is_active         10 non-null     bool
dtypes: bool(1), int64(5), object(5)
memory usage: 942.0+ bytes

,promotion_id,promotion_code,promotion_name,promotion_type,discount_value,min_order_amount,max_uses,current_uses,start_date,end_date,is_active
0,1,PROMOA4D288,Promoción 1,fixed_amount,23,610,8850,348,2024-03-10,2024-04-14,True
1,2,PROMOF7209F,Promoción 2,percentage,15,730,5983,376,2024-02-04,2024-04-16,True
2,3,PROMOFA8910,Promoción 3,buy_x_get_y,40,910,2339,335,2024-02-14,2024-03-25,True
3,4,PROMO888CAC,Promoción 4,free_shipping,40,180,5585,68,2024-02-05,2024-04-10,False
4,5,PROMO39BC49,Promoción 5,fixed_amount,9,940,2429,253,2024-05-24,2024-08-04,True

In [33]:
tables[ORDERS].info()
tables[ORDERS].head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          1000 non-null   int64
 1   order_number      1000 non-null   object
 2   customer_id       1000 non-null   int64
 3   order_date        1000 non-null   object
 4   status            1000 non-null   object
 5   subtotal          1000 non-null   float64
 6   discount_percent  1000 non-null   int64
 7   shipping_cost     1000 non-null   int64
 8   tax_amount        1000 non-null   float64
 9   total_amount      1000 non-null   float64
 10  payment_method    1000 non-null   object
 11  shipping_method   1000 non-null   object
 12  promotion_id      250 non-null    float64
 13  notes             172 non-null    object
dtypes: float64(4), int64(4), object(6)
memory usage: 109.5+ KB

,order_id,order_number,customer_id,order_date,status,subtotal,discount_percent,shipping_cost,tax_amount,total_amount,payment_method,shipping_method,promotion_id,notes
0,1,ORD-20240905-00001,107,2024-09-05,procesando,970.09,14,150,203.72,1188.00,debit_card,same_day,NaN,None
1,2,ORD-20230901-00002,334,2023-09-01,enviado,4339.79,4,440,911.36,5517.56,bank_transfer,pickup,NaN,None
2,3,ORD-20231108-00003,316,2023-11-08,procesando,1495.79,17,380,314.12,1935.63,credit_card,express,NaN,None
3,4,ORD-20230129-00004,220,2023-01-29,procesando,1160.68,20,340,243.74,1512.28,cash_on_delivery,express,NaN,None
4,5,ORD-20240728-00005,160,2024-07-28,pendiente,5065.31,12,200,1063.72,5721.19,debit_card,same_day,NaN,Nota del cliente: Dejar en portería

In [34]:
tables[ORDER_ITEMS].info()
tables[ORDER_ITEMS].head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3103 entries, 0 to 3102
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_item_id  3103 non-null   int64
 1   order_id       3103 non-null   int64
 2   product_id     3103 non-null   int64
 3   quantity       3103 non-null   int64
 4   unit_price     3103 non-null   float64
 5   subtotal       3103 non-null   float64
dtypes: float64(2), int64(4)
memory usage: 145.6 KB

   order_item_id  order_id  product_id  quantity  unit_price  subtotal
0              1         1          44         2       65.81    131.62
1              2         1          63         1      135.44    135.44
2              3         1          17         3       84.03    252.09
3              4         1          56         2      225.47    450.94
4              5         2          46         3      405.45   1216.35

In [35]:
tables[REVIEWS].info()
tables[REVIEWS].head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   review_id             200 non-null    int64
 1   product_id            200 non-null    int64
 2   customer_id           200 non-null    int64
 3   rating                200 non-null    int64
 4   title                 200 non-null    object
 5   comment               200 non-null    object
 6   is_verified_purchase  200 non-null    bool
 7   helpful_votes         200 non-null    int64
 8   created_at            200 non-null    object
dtypes: bool(1), int64(5), object(3)
memory usage: 12.8+ KB

,review_id,product_id,customer_id,rating,title,comment,is_verified_purchase,helpful_votes,created_at
0,1,30,256,1,No tan bueno,Muy buena calidad por el precio.,False,4,2023-12-24
1,2,99,137,3,Recomendado,Excelente relación calidad-precio.,True,12,2023-06-24
2,3,98,136,5,Podría mejorar,Muy buena calidad por el precio.,False,29,2025-11-16
3,4,11,240,5,Recomendado,Cumple con lo prometido.,True,12,2025-03-01
4,5,95,42,1,Muy bueno,No cumplió mis expectativas.,False,23,2025-01-08